Catalogs/Помещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Помещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБезКода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПомещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииБитрикса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Помещения/Ext/ManagerModule.bsl
&НаСервере
Функция ПолучитьИмяПапки(Сделка) Экспорт
	Возврат Сделка.Наименование;
КонецФункции // ПолучитьИмяПапки()

&НаСервере
Функция ПроверитьКаталогИзделия(Сделка,СсылкаНаПомещения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Помещения.Родитель.Проект, ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК РодительСделка
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаПомещения);
	
	КаталогСоответветствует = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		КаталогСоответветствует = Выборка.РодительСделка = Сделка;	
	КонецЦикла; 
	
	Если КаталогСоответветствует Тогда
		Возврат Истина;	
	КонецЕсли;
	
	ПеренестиПомещениеВГруппуОбъекта(Сделка,СсылкаНаПомещения);	
	
КонецФункции // ПроверитьКаталогИзделия()

&НаСервере
Процедура ПеренестиПомещениеВГруппуОбъекта(Сделка,СсылкаНаПомещения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Помещения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Проект = &Проект
		|	И Помещения.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ГруппаИзделияЗаказачика = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		ГруппаИзделияЗаказачика = Выборка.Ссылка;
	КонецЦикла;
	
	Если ГруппаИзделияЗаказачика = Неопределено Тогда
		ГруппаИзделияЗаказачика = СоздатьКаталогИзделия(Сделка);
	КонецЕсли;
	
	обИзделия = СсылкаНаПомещения.ПолучитьОбъект();
	обИзделия.Родитель = ГруппаИзделияЗаказачика;
	обИзделия.Записать();
	
КонецПроцедуры // ПеренестиИзделиеВГруппуОбъекта() 

&НаСервере
Функция СоздатьКаталогИзделия(Сделка)
	обГруппаПомещениеЗаказачика = Справочники.Помещения.СоздатьГруппу();
	обГруппаПомещениеЗаказачика.Проект = Сделка;
	обГруппаПомещениеЗаказачика.Наименование = "Помещения " + Сделка;
	обГруппаПомещениеЗаказачика.Записать();
	
	Возврат обГруппаПомещениеЗаказачика.Ссылка;

КонецФункции // СоздатьКаталог()

&НаСервере
Функция ПолучитьПомещенияОбъекта(Сделка, ВозвратВМассиве = Истина, ТолькоЭлементы = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Помещения.Ссылка КАК Помещения
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &ТолькоЭлементы
		|				ТОГДА Помещения.ЭтоГруппа = ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Помещения.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Сделка);
	Запрос.УстановитьПараметр("ТолькоЭлементы", ТолькоЭлементы);
	
	ЗапросВыполнение = Запрос.Выполнить();
	
	Если ВозвратВМассиве Тогда
		Возврат ЗапросВыполнение.Выгрузить().ВыгрузитьКолонку("Помещения"); 
	КонецЕсли;
	
	мВозврата = Новый Массив;
	Выборка = ЗапросВыполнение.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стВозврата = Новый Структура("Помещения", );
		ЗаполнитьЗначенияСвойств(стВозврата,Выборка);
		мВозврата.Добавить(стВозврата);
	КонецЦикла;
	
	Возврат стВозврата;	
КонецФункции // ПолучитьПомещенияОбъекта()

&НаСервере
Функция ПолучитьНаименованиеПомещения(Сделка,Помещение = Неопределено,НомерПомещения = "",НаименованиеБезКода = "") Экспорт

	Если Помещение = Неопределено Тогда
	
		текНомерПомещения 		= НомерПомещения;	
		текНаименованиеБезКода 	= НаименованиеБезКода;	
	
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Помещения.НаименованиеБезКода КАК НаименованиеБезКода,
		|	Помещения.НомерПомещения КАК НомерПомещения
		|ИЗ
		|	Справочник.Помещения КАК Помещения
		|ГДЕ
		|	Помещения.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Помещение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			текНомерПомещения 		= Выборка.НомерПомещения;	
			текНаименованиеБезКода 	= Выборка.НаименованиеБезКода;	
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Справочники.Проекты.ПолучитьНомерСделки(Сделка) + "." + текНомерПомещения + "." + текНаименованиеБезКода;	

КонецФункции // ПолучитьНаимекнованиеПомещения()
